//додано щонайменше 10 працівників, мінімальна зарплата має бути менше за 1000, максимальна - більше за 5 000, мають бути всі технічні рівні (Trainee, Junior, Middle, Senior)
INSERT INTO worker (name, birthday, level,salary) VALUES 
('name1','1990-10-01','Trainee', 800),
('name2','1981-10-01','Trainee', 850),
('name3','1982-10-01','Junior', 1250),
('name4','1983-10-01','Junior', 1350),
('name5','1984-10-01','Middle', 2500),
('name6','1985-10-01','Middle', 2700),
('name7','1986-10-01','Senior', 6000),
('name8','1987-10-01','Senior', 6500),
('name9','1988-10-01','Trainee', 600),
('name10','1989-10-01','Trainee', 700),
('name11','1978-10-01','Senior', 6500);

SELECT * FROM worker;
//////////////////////////////////////////////////////////
//додано щонайменше 5 клієнтів
INSERT INTO client(name) VALUES
('client1'),
('client2'),
('client3'),
('client4'),
('client5');
 
SELECT * FROM client;
///////////////////////////////////////////////////////////
//додано щонайменше 10 проєктів. Тривалість кожного проєкту (різниця START_DATE та FINISH_DATE) має бути від 1 до 100 місяців
INSERT INTO project(client_id, start_date, finish_date) VALUES
(1, '2019-10-01', '2023-04-20'),
(2, '2019-10-01', '2019-10-01'),
(3, '2015-10-01', '2023-04-20'),
(4, '2020-10-01', '2023-04-20'),
(5, '2021-10-01', '2023-04-20'),
(1, '2018-10-01', '2023-04-20'),
(2, '2017-10-01', '2023-04-20'),
(3, '2022-10-01', '2023-04-20'),
(3, '2020-03-01', '2023-04-20'),
(4, '2019-04-01', '2023-04-20');
 
SELECT * FROM project;
///////////////////////////////////////////////////////////
//назначені працівники на кожен проєкт. Над кожним проєктом має працювати від 1 до 5 працівників
DELETE FROM project_worker;
INSERT INTO project_worker(project_id, worker_id) VALUES
(1,1),
(1,2),
(1,3),
(2,1),
(3,2),
(4,3),
(5,3),
(6,5),
(7,6),
(8,7),
(9,8),
(10,9);

SELECT * FROM project_worker;
 
